 #define _CRT_SECURE_NO_WARNINGS 1
//A选手说：B第二，我第三；
//
//B选手说：我第二，E第四；
//
//C选手说：我第一，D第二；
//
//D选手说：C最后，我第三；
//
//E选手说：我第四，A第一；
#include<stdio.h>
int main()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 0; a < 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if ((1 == (b == 2) + (a == 3)) &&
							(1 == (b == 2) + (e == 4)) &&
							(1 == (c == 1) + (d == 2)) &&
							(1 == (c == 5) + (d == 3)) &&
							(1 == (e == 4) + (a == 1)))//通过表达式的返回值只是为1/0来确定他说的话一半对一半错,并且通过逻辑与来找到每个人都对的
						{
							if((a*b*c*d*e)==120)
							goto ture_rank;
						}
					}
				}
			}
		}

	}
ture_rank:
	printf("a的排名 == %d\nb的排名 == %d\nc的排名 == %d\nd的排名 == %d\ne的排名 == %d", a, b, c, d, e);
	return 0;
}
//#include<stdio.h>
////用位运算判断是否用重复的数字
//int isdif(int a, int b, int c, int d, int e) {
//    char tmp = 0;
//    tmp |= 1 << (a - 1);  //假设a=1,b=2,c=3,d=4,e=5
//    tmp |= 1 << (b - 1);  //1左移（1-1）位还是0000 0001
//    tmp |= 1 << (c - 1);  //1左移（2-1）位就是0000 0010
//    tmp |= 1 << (d - 1);  //以此类推，最后都跟tmp进行或运算
//    tmp |= 1 << (e - 1);  //最后tmp就变成了0001 1111
//    if (tmp == 31) {    //0001 1111正好等于31
//        return 1;
//    }
//    else {
//        return 0;
//    }
//}
//int main() {
//    int a, b, c, d, e;
//    for (a = 1; a <= 5; a++) {
//        for (b = 1; b <= 5; b++) {
//            for (c = 1; c <= 5; c++) {
//                for (d = 1; d <= 5; d++) {
//                    for (e = 1; e <= 5; e++) {
//                        //（表达式1 + 表达式2 ==1）的意思是这两者中必有一个为真一个为假
//                        if (((a == 3) + (b == 2) == 1) && ((b == 2) + (e == 4) == 1) &&
//                            ((c == 1) + (d == 2) == 1) && ((c == 5) + (d == 3) == 1) &&
//                            ((e == 4) + (a == 1) == 1) && (isdif(a, b, c, d, e)) == 1) {
//                            printf("%d %d %d %d %d\n", a, b, c, d, e);
//                        }
//                    }
//                }
//            }
//        }
//    }
//    return 0;
//}